Hey @radeksimko to clarify this is not an issue with the `google_kms_secret` attribute.`google_monitoring_notification_channel` reveals the sensitive contents of the `labels` attribute when used in isolation as well. Eg.

```
resource "google_monitoring_notification_channel" "slack" {
  display_name = "foobar"
  type         = "slack"

  labels = {
    "auth_token"   = "NOT_A_REAL_SECRET_BUT_YOU_GET_THE_POINT"
    "channel_name" = "#foobar"
  }
}
```

```
Terraform will perform the following actions:

  # google_monitoring_notification_channel.slack will be created
  + resource "google_monitoring_notification_channel" "slack" {
      + display_name        = "foobar"
      + enabled             = true
      + id                  = (known after apply)
      + labels              = {
          + "auth_token"   = "NOT_A_REAL_SECRET_BUT_YOU_GET_THE_POINT"
          + "channel_name" = "#foobar"
        }
      + name                = (known after apply)
      + project             = (known after apply)
      + type                = "slack"
      + verification_status = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```